Add the old diagram
